{
  "iss-tutorial": [
    {
      "id": "welcome",
      "character": "Neil",
      "text": "Hello there, space explorer! My name is Neil DePaws Tyson, and I'll be your guide on this journey. Welcome to the International Space Station tutorial!"
    },
    {
      "id": "movement-intro",
      "character": "Neil",
      "text": "First, let's learn how to move your spacecraft. Use the arrow keys on your keyboard to navigate through space."
    },
    {
      "id": "fuel-explanation",
      "character": "Neil",
      "text": "Your spacecraft runs on fuel! Every time you move, you consume fuel. Keep an eye on your fuel gauge in the top right corner."
    },
    {
      "id": "fuel-warning",
      "character": "Neil",
      "text": "If you run out of fuel, you'll stop moving and drift in space. Always make sure you have enough fuel to reach your destination!"
    },
    {
      "id": "iss-facts-1",
      "character": "Neil",
      "text": "The International Space Station, or ISS, orbits Earth at about 408 kilometers above the surface, traveling at 7.66 kilometers per second!"
    },
    {
      "id": "iss-facts-2",
      "character": "Neil",
      "text": "The ISS serves as a microgravity laboratory where astronauts conduct experiments in biology, physics, astronomy, and more."
    },
    {
      "id": "refuel-instruction",
      "character": "Neil",
      "text": "To refuel your spacecraft, you need to dock at the ISS. Navigate your ship close to the station - you'll see it when you're near!"
    },
    {
      "id": "quiz-requirement",
      "character": "Neil",
      "text": "Before you can refuel, you'll need to answer some questions about the ISS. Don't worry - you can try as many times as you need!"
    }
  ],
  "password-hint": [
    {
      "id": "pwd-intro",
      "character": "Neil",
      "text": "Hold on! The pump is locked. We need to bypass the security protocols to refuel."
    },
    {
      "id": "pwd-instruction",
      "character": "Neil",
      "text": "I'm patching you into the system. The password is hidden inside the text log."
    },
    {
      "id": "pwd-tip",
      "character": "Neil",
      "text": "Here is a hint: Look for words written in ALL CAPS. Combine them together to form the password!"
    }
  ],
  "refuel-success": [
    {
      "id": "quiz-success",
      "character": "Neil",
      "text": "Excellent work! You've successfully refueled. Now you're ready to continue your journey through space."
    }
  ],
  "moon-exploration-tutorial": [
    {
      "id": "moon-welcome",
      "character": "Neil DePaws Tyson",
      "text": "Welcome to the Moon exploration zone! Here you'll collect lunar intel and test your knowledge."
    },
    {
      "id": "moon-movement",
      "character": "Neil DePaws Tyson",
      "text": "Use WASD or arrow keys to navigate your ship. Watch out for moving asteroids - they'll drain your fuel if you hit them!"
    },
    {
      "id": "moon-data-capsules",
      "character": "Neil DePaws Tyson",
      "text": "Look for data capsules scattered around the map. Collect them to learn lunar facts that will help you on the quiz!"
    },
    {
      "id": "moon-quiz-strategy",
      "character": "Neil DePaws Tyson",
      "text": "You can take the quiz at the moon icon anytime, but collecting all data capsules first will make it much easier. Without them, you'll face harder questions!"
    },
    {
      "id": "moon-refuel",
      "character": "Neil DePaws Tyson",
      "text": "There's a refuel station in the center of the map if you need more fuel. Be careful though - it can only be used once before it disappears, so use it wisely! Good luck, explorer!"
    }
  ],
  "moon-quiz-complete": [
    {
      "id": "moon-quiz-congratulations",
      "character": "Neil DePaws Tyson",
      "text": "Outstanding work, explorer! You've mastered the Moon and proven you can collect intel and pass the quiz."
    },
    {
      "id": "solar-system-unlock",
      "character": "Neil DePaws Tyson",
      "text": "Now that you know how to do it, explore the solar system as you see fit. The further you travel, the more difficult it gets!"
    },
    {
      "id": "planet-selection",
      "character": "Neil DePaws Tyson",
      "text": "Choose your next destination from Mercury to Neptune. You can revisit planets you've already explored, except for the ISS tutorial. Ready to continue your journey?"
    }
  ]
}
